Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ཡོན་ཏན་མཐུ་སྟོབས་སྤྱད་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཏོག་གི་འོད་དེ་ལ། །ཙན་ཙ་ཏིཀ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇabala, when a cowherd, Offered carcika herbs To the thus-gone Crest Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་དབང་རྩིས་པའི་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་ཐུལ་དེ་ལ་ནི། །མེ་ཏོག་མྱ་ངན་འཚང་གི་ཆུན་པོ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Deveśvara, when a young astrologer, Offered aśoka flowers To the thus-gone Tamer of Enemies And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་མེ་ཏོག་གི། །བཞུགས་ཁང་སྤོས་ཀྱི་བྱུག་པས་བྱུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mañjughoṣa, when an incense merchant, Smeared the residence of the thus-gone Nectar Flower With fragrant substances And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ངོས་བཟང་རྩལ་ཆེན་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཆེན་པོ་ལ། །འདུན་ཁང་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Supārśva, when a powerful brahmin, Offered an open-sided pavilion To the thus-gone Great Fame And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་གནས་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕན་པར་དགོངས་དེ་ལ། །སྣོད་དག་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthitārtha, when a destitute, Offered vessels filled with water To the thus-gone Intent on Helping And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་གཟི་བརྗིད་དཔལ་ནི་ཁྱིམ་བདག་ཚེ། །དགེ་འདུན་དག་ལ་རྙེད་པ་སྣུམ་བག་ཕུལ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་དམ་པ་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇatejas, when a householder, Offered oil to the members of the saṅgha Before the thus-gone True Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཁྱེན་ལྡན་ཟླ་མེད་རྩིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་དེ་ལ། །གུར་ཀུམ་བྱུག་པ་ལག་གིས་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anuttarajñānin, when an astrologer, Offered saffron ointment To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ང་རོ་དཔག་མེད་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འདམ་ལས་རྒལ་བ་ལ། །ཧ་རི་ནི་ཀའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitasvara, when a cattle herder, Scattered yellow jasmine flowers Before the thus-gone Crossing the Swamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་བཟངས་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྲིད་པ་གསལ་བ་ལ། །ཀུན་ཏུ་ར་ཀའི་བདུག་པས་བདུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sukhābha, when an incense merchant, Offered kunturaka incense To the thus-gone Illuminator of Existence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་ཐུགས་གཞུངས་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མེ་ཏོག་ལ། །ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ་ཕྱག་འཚལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumedhas, when a destitute, Joined his palms in homage Before the thus-gone Dharma Flower And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་དགོངས་གཏི་མུག་བྲལ། །འཁོར་ལོས་སྒྱུར་ཚེ་བདེ་གཤེགས་དཔལ་ཆེན་ལ། །གྲོང་ཁྱེར་དཔག་ཚད་བཅུ་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vigata­mohārtha­cintin, when a universal monarch, Offered a city covering ten leagues To the well-gone Great Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབྱངས་ཀྱི་ཡན་ལག་ཁྱད་པར་འཕགས། །ཤིང་སྲུངས་ཚེ་ན་བདེ་གཤེགས་འོད་བྱེད་ལ། །ཕ་གུའི་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Viśiṣṭa­svarāṅga, when a forest guard, Offered phagu fruit To the well-gone Radiant And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོག་ཏུ་མཛེས་གཤེགས་རྩིས་པ་ཡི། །བྲན་མོའི་ཚེ་ན་བདེ་གཤེགས་མེ་འོད་ལ། །མེ་ཏོག་ཀར་ནི་ཀ་རས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitāgragāmin, when a female servant of an astrologer, Scattered karṇika flowers Before the well-gone Fire Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཞི་དོན་རྒྱལ་པོའི་ཕོ་ཉ་ཚེ། །དེ་བཞིན་གཤེགས་པ་བལྟ་ན་སྡུག་པ་ལ། །ལན་གྲངས་བརྒྱ་སྙེད་བསྐོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śāntārtha, when a royal messenger, Circumambulated one hundred times The thus-gone Beautiful to Behold And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐྱོན་མེད་རྟེན་བཅས་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣང་བར་དགྱེས་པ་ལ། །མོན་སྲན་སྡེའུ་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Adoṣa, when having a single support, Offered green beans To the thus-gone Joyful Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་སྦྱངས་དགེ་བ་ཤིང་འཚོང་ཚེ། །སྒོ་གང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དབྱངས་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śubha­cīrṇa­buddhi, when a timber merchant, Offered a gateway To the thus-gone Melody of Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་མའི་མཛོད་ནི་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་སྦྱིན་བྱིན་པ་ལ། །སྐུ་ཡི་ཁྲུས་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmakośa, when a monk, Offered bathing soap To the thus-gone Sacrifice Gift And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་བཟང་པོ་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པའི་མཐུ་རྩལ་ལ། །བསོད་སྙོམས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suraśmi, when a poor man, Offered alms To the thus-gone Power of the Truth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོབས་པའི་མདོག་ནི་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་བློ་དེ་ལ། །ཤུ་ཏིའི་མེ་ཏོག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratibhāna­varṇa, when a forest guard, Offered dill flowers To the thus-gone Unimpeded Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྟེགས་བཟང་སྒོ་བའི་ཚེ། །བདེ་གཤེགས་མདངས་འོད་གྲོང་ཁྱེར་གཤེགས་པ་ན། །ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་དག་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sutīrtha, when a gatekeeper, Joined his palms in homage As the well-gone Bright Light entered the city And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་དབང་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་སྙིང་པོ་ལ། །རྣ་རྒྱན་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇendra, when the son of a merchant, Offered ear ornaments To the thus-gone Moon Essence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་བྲལ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་འོད་དེ་ལ། །མེ་ཏོག་ཏ་ར་ནི་ཡིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vigatabhaya, when a brahmin, Scattered hibiscus flowers Before the thus-gone Brahmā Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་བཞེད་པ་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་དེ། །ཕོངས་པ་མེད་པས་སྤྱན་དག་དྲངས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaruci, when a poor man, Offered an unstinting invitation To the thus-gone Great Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་ཅན་དཀའ་ཐུབ་ཅན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེ་བའི་འོད་དེ་ལ། །ལོ་མའི་སྤྱིལ་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gandha, when an ascetic, Offered a cottage made of leaves To the thus-gone Blissful Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་མཆོག་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་མཆོག་དེ་ལ་ནི། །ཨ་ག་རུ་ཡི་བདུག་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Varabuddhi, when a merchant, Offered aloeswood incense To the thus-gone Supreme Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ཤིང་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞི་བའི་འོད་དེ་ལ། །བ་རུ་ར་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candra, when a wood gatherer, Offered beleric myrobalan fruits To the thus-gone Light of Peace And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཟླ་འོད་ཚོང་པའི་ཚེ། །བདེ་གཤེགས་ཡིད་གཉིས་ལས་ནི་འདས་པ་ལ། །ནོར་བུ་རིན་ཆེན་མེ་ཤེལ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnābhacandra, when a merchant, Offered a precious sun-crystal To the well-gone Beyond Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསྙེངས་མེད་མདུན་འདོན་བུར་གྱུར་ཚེ། །བདེ་གཤེགས་འཁྲུལ་པ་མེད་པའི་བློ་ལྡན་ལ། །སིན་དྷུ་བ་རིའི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhaya, when the son of a royal priest, Offered sindhubara flowers To the well-gone Mind Free from Delusion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟིགས་པ་ཆེན་པོ་རྩྭ་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་འབྱོར་དེ་ལ། །ཨ་ག་རུ་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahādarśana, when a straw collector, Offered aloeswood fruit To the thus-gone Wealth of Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་དབྱངས་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡན་ལག་མཛེས་པ་ལ། །རྒྱ་ཤུག་འབྲས་བུའི་ཕྱེ་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmaruta, when a physician, Offered jujube fruit powder To the thus-gone Beautiful Limbs And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབྱངས་བཟང་ལྷ་རིས་པ་ཡི་ཚེ། །བུ་ཡུག་ལངས་ཚེ་ཁང་པ་ཕྱགས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་དགྱེས་པ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sughoṣa, when a god, Swept the house at the time of a snowstorm Before the thus-gone Fearless Delight, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་ཆེ་སྟེགས་ནད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་གྲངས་དབྱངས་དེ་ལ། །པི་པི་ལིང་གི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahā­prajñā­tīrtha, when suffering from illness, Offered peppercorns To the thus-gone Melody of Categories And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་ཟླ་མེད་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་ནི་ཆེན་པོ་དེ། །ཉི་མ་འགའ་ཞིག་བཞུགས་པར་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asamabuddhi, when a merchant, Requested the thus-gone Great Melody To stay for a few days And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྡོ་རྗེ་མཁྲེགས་ནི་བྱིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་འབྱེད་ལྡན་ལ། །ཏིལ་དང་འདྲེས་པའི་འབྲས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Acalaprajñābha, when a young child, Offered rice mixed with sesame To the thus-gone Endowed with Discernment And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བྱང་ཆུབ་བློ་གྲོས་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་ཆེན་པོ་ལ། །མེ་ཏོག་བར་ཤི་ཀ་དག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Buddhimati, when a potter, Scattered vārṣikī flowers Before the thus-gone Great Intention And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྗོན་ཤིང་དབང་པོ་རྒྱལ་པོ་ཡི། །ཕོ་ཉའི་ཚེ་ན་བདེ་གཤེགས་གཟུགས་གསལ་ལ། །སྐུ་རེགས་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Drumendra, when a royal messenger, Offered a single belt To the well-gone Luminous Form And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གདངས་སྙན་འདྲོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་དེ། །འཇིགས་པ་མེད་པས་ལམ་ཀར་སྤྱན་དྲངས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ghoṣasvara, when a traveler, Guided the thus-gone Great Power Along the road without danger And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་སྟོབས་ནི་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེ་བར་གཟིགས་དེ་ལ། །ཞུན་མར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyabala, when a merchant, Offered clarified butter To the thus-gone Blissful Vision And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་དཔལ་དགེ་སློང་ཚེ། །བཟོད་པ་དག་ནི་བསྒོམ་པ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་གནོད་པ་སྤངས་པ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthāmaśrī, when a monk, Cultivated patience Before the thus-gone Relinquishing Harm, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཕགས་དགྱེས་དགོན་པའི་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞི་བ་གསལ་དེ་ལ། །སྲན་གྱི་ཕྱེད་ཙམ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Āryapriya, when a monk living in solitude, Offered half a bean To the thus-gone Luminous Peace And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་སྟོབས་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིམས་མེད་བློ་ལྡན་ལ། །འབྲས་བུ་སར་པ་མཆོག་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pratapta, when a garland maker, Offered exquisite fresh fruit To the thus-gone Mind Free from the Contagions And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐར་དགྱེས་བཅའ་བ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་སྟེགས་དེ་ལ། །སྣོད་དག་སྦྲང་རྩིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jyotīrāma, when a cook, Offered a vessel filled with honey To the thus-gone Support for the Worthy Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྲིན་གྱི་རྔ་སྒྲ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་ལྡན་ལེགས་བསགས་ལ། །ཨུ་ཤི་ར་ཡི་ཕྱེ་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dundubhi­megha­svara, when an incense merchant, Offered uśira powder To the thus-gone Wise Accumulator of Goodness And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་དག་སྡུག་པའི་ཞལ། །ཕྱག་དར་པ་ཚེ་རྔ་ཆེན་བརྡུངས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་གསལ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Priya­cakṣurvaktra, when a sweeper, Beat a great drum Before the thus-gone Universal Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་བཟང་ལྡན་ཤིང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་གཟི་བརྗིད་ལ། །སྣོད་དག་འོ་མས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sujñāna, when the master of a forest, Offered vessels filled with milk To the thus-gone Moon Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འབྱོར་ལྡན་རྟེན་བཅས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མཆོད་གནས་ལ། །ལ་དུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Samṛddha, when having a support, Offered laḍḍu To the thus-gone Recipient of Divine Worship And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་ཕུང་པོ་ཀུན་རྒྱུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་དབྱངས་དེ་ལ། །ཀྲྀཥྞ་ས་རའི་པགས་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇarāśi, when a wandering ascetic, Offered a spotted antelope hide To the thus-gone Divine Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གསལ་བ་རྒྱལ་པོའི་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཉི་མ་ལ། །གསེར་གྱི་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prasanna, when a princess, Offered a golden garland To the thus-gone Flower Sun And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་རྒྱལ་མཚན་སློང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་གནས་ཞབས་དེ་ལ། །གོས་ཀྱི་རས་མ་སོར་བཞི་ཙམ་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmadhvaja, when a beggar, Offered a patch of clothing the size of four finger widths To the thus-gone Support for Excellent Abiding And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་ང་རོ་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་ཏོག་དེ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaruta, when the son of a merchant, Offered toothsticks To the thus-gone Crest And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་ཤིང་ཐུན་ཚེ། །བདེ་གཤེགས་སྣ་མའི་མེ་ཏོག་གསལ་དེ་ལ། །རྒྱ་ཤུག་དག་གི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Gagana, when a wood gatherer, Offered jujube fruit To the well-gone Luminous Sumanā Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོད་སྦྱིན་ང་རོ་རྟེན་བཅས་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོབས་ཀྱི་འོད་དེ་ལ། །བལ་སྲན་གྲེའུ་དང་སྦྱར་བའི་འབྲུ་མར་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yajñasvara, when having a support, Offered oil made with beans To the thus-gone Light of Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་རྣམ་འགོད་ང་རོ་ནི། །རལ་པ་ཅན་ཚེ་བདེ་གཤེགས་ཡོན་ཏན་བཞེད། །དེ་ལ་དཀའ་ཐུབ་གནས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñāna­vihāsa­svara, when a dreadlocked ascetic, Offered a place for the performance of austerities To the well-gone Acceptance of Excellent Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་འོད་ཟེར་གཟི་བརྗིད་བཟང་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མེ་ཏོག་དེ་ཡི་ནི། །ཆོས་གོས་སྣམ་སྦྱར་དག་ནི་དྲུབ་པ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇatejoraśmi, when a tailor, Sewed cīvara and saṃghāṭi robes For the thus-gone Dharma Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲང་སྲོང་དབང་པོ་བསོད་སྙོམས་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཛེས་པ་ལ། །ཁབ་རལ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ṛṣīndra, when a recipient of alms, Offered a needle case To the thus-gone Splendid Beauty And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་ལྡན་ཕྱུགས་རྫིའི་དཔོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྣང་མཛད་ལ། །ལྷུང་བཟེད་འོ་མས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Matimat, when a leader of cattle herders, Offered an alms bowl filled with milk To the thus-gone Illuminating Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོབས་པའི་ཚོགས་ནི་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞི་བའི་འོད་དེ་ལ། །ཙམ་པ་ཀ་ཡི་ཚལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratibhānagaṇa, when a prince, Offered a garden of campaka flowers To the thus-gone Light of Peace And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོད་སྦྱིན་བཟང་པོ་ཤིང་ཐུན་ཚེ། །བདེ་གཤེགས་ཀུན་དུ་ཡོན་ཏན་མཆོག་དེ་ལ། །ཤིང་བིལ་བ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suyajña, when a wood gatherer, Offered wood apple trees To the well-gone Universally Supreme Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་ཞལ་མར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་རྣམ་རྒྱལ་ལ། །ཞུན་མར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candrānana, when a butter merchant, Offered clarified butter To the thus-gone Victorious Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་གཟིགས་པ་ད་ནུར་མཁན། །བྱེད་ཚེ་དེ་བཞིན་གཤེགས་པ་ལྷས་མཆོད་ལ། །བག་ཆོས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ།། །།
en: “The well-gone Sudarśana, when a baker, Offered a cake To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྡུལ་བྲལ་འདྲེག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་དབྱངས་དེ་ལ། །སྤུ་གྲི་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Viraja, when a barber, Offered a razor To the thus-gone Divine Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་ཚོགས་ནི་ཁྲུས་པའི་ཚེ། །བདེ་གཤེགས་འཁྲུལ་པ་མེད་པར་སྦྱོར་བ་ལ། །ཁྲུས་ཁང་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇasañcaya, when a bath attendant, Offered a bathing house To the well-gone Engagement Free from Delusion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཏོག་ལྡན་ཁྱིམ་བདག་ཚེ་ན་དེ་བཞིན་གཤེགས། །བརྩོན་འགྲུས་ཆེན་པོ་འཁོར་དང་བཅས་པ་བྱེ་བ་དག །དབྱར་གནས་ཟླ་གསུམ་ཞལ་ཟས་རོ་བརྒྱ་པ་གསོལ་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ketumat, when a householder, Offered meals with a hundred flavors during the three months of the rains retreat To the thus-gone Great Diligence and his retinue of ten million, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་སྤོབས་པ་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་འོང་དབྱངས་དེ་ལ། །མར་མེའི་སྙིང་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratibhāna­rāṣṭra, when a poor person, Offered lamp wicks To the thus-gone Compelling Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་རབ་སྦྱིན་བྱི་བོ་བྱེད་པའི་ཚེ། །ཉི་མ་འགའ་ཞིག་ཚངས་པར་སྤྱོད་པ་མནོས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་དབྱངས་ཅན་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnapradatta, when an adulterer, Adhered to celibacy for a few days Before the thus-gone Possessor of Universal Melody, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་དགྱེས་པ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྨོན་ལམ་སྦྱངས་པ་ལ། །སྒེའུ་གཤེར་མེ་ཏོག་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Priyacandra, when a prince, Scattered ginger flowers Before the thus-gone Purified Aspiration And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁེངས་མེད་བཅའ་བ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་འདོད་དེ་ལ་ནི། །མར་ཁུར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anunnata, when a cook, Offered clarified butter To the thus-gone Desired by Gods And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྟོབས་ནི་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་སྟོབས་དེ་ལ། །ཨ་མྲའི་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhabala, when a brahmin, Offered mango fruits To the thus-gone Strength of Insight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབང་སྒྱུར་རྒྱལ་པོའི་ཁྱིམ་བདག་གི། །བུ་ཚེ་བདེ་གཤེགས་ཀུན་དུ་གཟིགས་དེ་ལ། །སླེ་ཏྲེས་ལོ་མ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaśavartirāja, when the son of a householder, Scattered guḍūcī leaves Before the well-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩི་གསལ་བ་མཆོངས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚངས་པས་མཆོད་དེ་ལ། །གསེར་སྣམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amṛtaprasanna, when an expert on agates, Offered golden cloths To the thus-gone Worshiped by Brahmā And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསམ་གཏན་སྙོམས་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐུབ་པའི་མེ་ཏོག་ལ། །མེ་ཏོག་དག་གིས་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samadhyāyin, when a forest guard, Offered flowers To the thus-gone Flower of the Able And in doing so first gave rise to the mind of awakening.
